/* 
    * Зробити певний клас-контейнер на основі масиву або ланцюгового
    * списку з двома методами, які реалізують алгоритми простого сортування «бу-
    * льбашкою» та вставками. Вихідні дані задавати датчиком випадкових чисел.

    * Завдання. 
    * Вивчити алгоритми сортування масивів та списків, навчитися
    * використовувати їх при обробці даних. Відповідно варіанту завдання скласти
    * програми, що реалізують два метода сортування. Після виконання роботи сту-
    * дент повинен вміти застосовувати алгоритми сортування масивів та списків для
    * обробки даних.
 */

#include "arrayContainer.cpp"

int main() {
    const int arraySize = 10;

    ArrayContainer container(arraySize);

    std::cout << "Початковий масив: ";
    container.display();

    container.bubbleSort();
    std::cout << "Масив після сортування бульбашкою: ";
    container.display();

    container.generateRandomData();
    std::cout << "Початковий масив: ";
    container.display();

    container.insertionSort();
    std::cout << "Масив після сортування бульбашкою: ";
    container.display();

    return 0;
}