/* 
    *   Завдання. 
    *   Виконати наступні пункти.
    *   1. Заповнити масив цілочисельними випадковими числами в діапазоні від
    *   1 до 100. Розмір масиву n обчислюється як ціла частина від значення виразу n
    *   = 10+ 0,6 *m, де m – номер студента в журналі.
    *   2. Відсортувати масив методом сортування:
    *   - вибором – студентам з парними номерами варіантів;
    *   - вставками – студентам з непарними номерами варіантів.
    *   Знайти ключ, який:
    *   - знаходиться в середині лівої частини масиву – студентам з парними
    *   номерами варіантів;
    *   - знаходиться в середині правої частини масиву – студентам з непарни-
    *   ми номерами варіантів.
    *   4. Пошук ключа здійснити двома методами:
    *   - послідовним та бінарним– студентам з парними номерами варіантів;
    *   - послідовним та інтерполяційним– студентам з непарними номерами
    *   варіантів.
 */

#include <iostream>
#include "arrayOperations.cpp"

int main() {
    int studentNumber;
    std::cout << "Введіть номер студента: ";
    std::cin >> studentNumber;

    ArrayOperations arrayOperations(studentNumber);
    arrayOperations.fillArray();
    arrayOperations.sortArrays();
    arrayOperations.findKeys();

    return 0;
}
